In [2]:
import pandas as pd
import numpy as np

# Replacing Values

In [4]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [5]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [6]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [9]:
data.replace({-999: 4, -1000: 0})

0    1.0
1    4.0
2    2.0
3    4.0
4    0.0
5    3.0
dtype: float64

# Renaming Axis Indexes

In [22]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)),
        index=['Ohio', 'Colorado', 'New York'],
        columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [23]:
transform = lambda x: x[:4].upper()

In [24]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [25]:
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [26]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [30]:
data.index = data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [31]:
data.rename(index={'OHIO': 'INDIANA'},
            columns={'three': 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [32]:
data.rename(index={'OHIO': 'INDIANA'}, inplace=True)

In [33]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

# Discretization and Binning

In [42]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [47]:
cats = pd.cut(ages, bins)
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [44]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [45]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [46]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [48]:
pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [49]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [50]:
pd.cut(ages, bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [51]:
data = np.random.rand(20)

In [52]:
pd.cut(data, 4, precision=2)

[(0.73, 0.97], (0.025, 0.26], (0.73, 0.97], (0.26, 0.5], (0.5, 0.73], ..., (0.73, 0.97], (0.5, 0.73], (0.025, 0.26], (0.73, 0.97], (0.5, 0.73]]
Length: 20
Categories (4, interval[float64]): [(0.025, 0.26] < (0.26, 0.5] < (0.5, 0.73] < (0.73, 0.97]]

# Detecting and Filtering Outliers

In [54]:
data = pd.DataFrame(np.random.randn(1000, 4))
data

            0         1         2         3
0   -0.334715  1.875585 -0.110213  0.608901
1    0.666384 -0.382867 -0.441493  0.952997
2   -1.678855 -1.627514  0.074713 -1.023343
3    0.997524 -1.059146  0.706324  1.598820
4    0.786242  0.954071  0.731891 -0.241131
5   -1.569889  1.040541  0.014314  0.631461
6   -0.238499 -2.484451  0.039166  0.830433
7    1.784542  0.143570  1.560977 -0.201562
8    0.542451 -0.603258  0.410110  2.376450
9   -1.298847 -1.238574  1.652789  0.277876
10  -0.852359 -0.439256  1.336131 -0.159120
11  -0.048466  0.949717 -0.454077 -0.053702
12   0.523973  0.328785 -1.660321  1.030096
13   0.835795  1.227247 -1.837603  0.198089
14  -0.615887  0.185043  0.264032  0.969212
15   0.876201  0.530314  0.781529 -1.646654
16  -0.502178  0.548334  0.105383  2.175389
17  -1.033410  0.751278 -0.365383 -0.544511
18   0.959596  0.158697  0.333714 -0.600345
19   0.061264  1.402788 -0.406879  0.019933
20   0.520493  1.269098  0.072131  1.304741
21  -1.176940 -0.166040 -2.518861  0.887893
22  -0.329416  0.789035  0.224717  0.641259
23   0.318460  0.327877 -0.889108 -1.846887
24  -1.036735 -1.144906  0.674357 -1.158503
25   0.591784  2.078127 -0.504805 -1.142646
26  -0.667505 -1.466937  0.258301 -0.662343
27  -1.209889 -0.946647 -0.207513 -0.327721
28   1.276788 -1.447647  1.390307 -1.640019
29  -0.898284  0.096413 -0.751580  0.340997
..        ...       ...       ...       ...
970  1.548599 -1.139510 -0.343093  0.216521
971 -0.136615  1.048752  1.020262  1.114518
972  0.415384  0.485001  0.630941  0.169462
973 -0.916799  0.050007  1.589995  0.599655
974  0.000671  0.429715  0.458301 -0.152523
975  0.850142 -0.628508 -0.005280  0.703539
976 -0.293833 -0.407995 -1.817405  0.903011
977  1.128375 -1.719878  1.880237 -0.049198
978  0.278514  0.789839  0.996149  0.098398
979 -0.223069  2.187669  1.298853  2.161259
980  0.825601  1.651371  0.739150  0.555715
981  0.286978 -0.604573  0.869468  0.504667
982 -0.704296 -1.460054 -0.446800  0.328343
983 -0.651718 -1.761010  0.956528  0.225499
984  0.665745  0.532744  1.310946  1.686494
985 -0.335269 -0.628162  1.285450  1.008233
986 -0.396675  0.695584  1.580649 -1.453525
987 -0.550422  1.731230  0.362193  0.457648
988  0.476272 -1.850159  0.159042  1.545150
989  0.907730 -0.185136 -1.183214 -0.579023
990  0.734994  0.574414  0.687489 -0.237947
991 -0.890068  0.479712 -0.166895  0.710196
992 -1.100614 -2.316764 -0.825326 -0.487723
993  0.977637 -1.157446  1.657302 -1.525435
994  0.222732  0.479072  1.370002  1.114129
995 -1.476895  0.755761 -1.759772 -0.193427
996 -1.407308 -0.134463  1.643279  1.581584
997  1.147502  0.804578 -0.175674 -0.658700
998  1.633256  0.056342 -0.311388  0.050758
999 -0.196166 -0.565013 -0.601375  1.075101

[1000 rows x 4 columns]

In [55]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.009331    -0.058298    -0.017113    -0.034164
std       0.982848     0.987035     1.000564     0.979396
min      -2.887186    -3.045192    -3.699110    -2.803134
25%      -0.647461    -0.686429    -0.697284    -0.729107
50%      -0.048652    -0.057205    -0.000583    -0.041638
75%       0.669405     0.581068     0.675388     0.630310
max       2.881556     3.288232     3.354367     2.809678

In [58]:
col = data.head(10)
col

          0         1         2         3
0 -0.334715  1.875585 -0.110213  0.608901
1  0.666384 -0.382867 -0.441493  0.952997
2 -1.678855 -1.627514  0.074713 -1.023343
3  0.997524 -1.059146  0.706324  1.598820
4  0.786242  0.954071  0.731891 -0.241131
5 -1.569889  1.040541  0.014314  0.631461
6 -0.238499 -2.484451  0.039166  0.830433
7  1.784542  0.143570  1.560977 -0.201562
8  0.542451 -0.603258  0.410110  2.376450
9 -1.298847 -1.238574  1.652789  0.277876

In [60]:
np.abs(col[np.abs(col) >= 1])

          0         1         2         3
0       NaN  1.875585       NaN       NaN
1       NaN       NaN       NaN       NaN
2  1.678855  1.627514       NaN  1.023343
3       NaN  1.059146       NaN  1.598820
4       NaN       NaN       NaN       NaN
5  1.569889  1.040541       NaN       NaN
6       NaN  2.484451       NaN       NaN
7  1.784542       NaN  1.560977       NaN
8       NaN       NaN       NaN  2.376450
9  1.298847  1.238574  1.652789       NaN

In [63]:
col[(np.abs(col) > 1).any(1)]

          0         1         2         3
0 -0.334715  1.875585 -0.110213  0.608901
2 -1.678855 -1.627514  0.074713 -1.023343
3  0.997524 -1.059146  0.706324  1.598820
5 -1.569889  1.040541  0.014314  0.631461
6 -0.238499 -2.484451  0.039166  0.830433
7  1.784542  0.143570  1.560977 -0.201562
8  0.542451 -0.603258  0.410110  2.376450
9 -1.298847 -1.238574  1.652789  0.277876

In [65]:
np.sign(col)  #1-->+ve , -1 --> -ve

     0    1    2    3
0 -1.0  1.0 -1.0  1.0
1  1.0 -1.0 -1.0  1.0
2 -1.0 -1.0  1.0 -1.0
3  1.0 -1.0  1.0  1.0
4  1.0  1.0  1.0 -1.0
5 -1.0  1.0  1.0  1.0
6 -1.0 -1.0  1.0  1.0
7  1.0  1.0  1.0 -1.0
8  1.0 -1.0  1.0  1.0
9 -1.0 -1.0  1.0  1.0

# Permutation and Random Sampling

In [67]:
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [71]:
sampler = np.random.permutation(5)
sampler

array([2, 1, 3, 0, 4])

In [72]:
df.take(sampler)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
3  12  13  14  15
0   0   1   2   3
4  16  17  18  19

In [78]:
df.sample(n=3)

    0   1   2   3
4  16  17  18  19
1   4   5   6   7
3  12  13  14  15

In [80]:
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                'data1': range(6)})
df

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [81]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [93]:
a = [1, 2, 3]
a

[1, 2, 3]

In [94]:
a.append([4,5,6])
a

[1, 2, 3, [4, 5, 6]]

In [95]:
a.extend([4,5,6])
a

[1, 2, 3, [4, 5, 6], 4, 5, 6]

In [106]:
val = 'Presidential Initiative Artificial Intelligence Computing'
val

'Presidential Initiative Artificial Intelligence Computing'

In [107]:
val = val.split()
val

['Presidential', 'Initiative', 'Artificial', 'Intelligence', 'Computing']

In [108]:
print(val[0]+' '+val[1]+' '+val[2]+' '+val[3]+' '+val[4])

Presidential Initiative Artificial Intelligence Computing

In [109]:
' '.join(val)

'Presidential Initiative Artificial Intelligence Computing'

In [110]:
'Presidential' in val

True

In [111]:
val.index('Computing')

4

In [113]:
val[0].find('z')

-1

In [115]:
data = pd.Series(np.random.randn(9),
                 index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'],
                        [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    2.037272
   2   -0.966569
   3   -0.354113
b  1   -0.341904
   3   -0.056353
c  1    0.363628
   2   -0.962773
d  2    0.505140
   3   -0.927031
dtype: float64

In [119]:
data['a'][2]

-0.9665690904265667

In [120]:
data['d'][3]

-0.9270308451405349

In [121]:
data['c'][2]

-0.9627734806326479